{
  "domains": {
    "Accounting and Finance": "Skills related to financial planning, accounting principles, auditing, and financial reporting.",
    "Agricultural Science": "Skills related to crop production, soil science, and agricultural technology.",
    "Artificial Intelligence": "Skills related to machine learning, neural networks, and intelligent systems.",
    "Automotive Maintenance": "Skills related to vehicle diagnostics, repair, and maintenance.",
    "Biotechnology": "Skills related to genetic engineering, molecular biology, and biotech applications.",
    "Business Administration": "Skills related to business operations, management, and organizational strategy.",
    "Chemical and Material Science": "Skills related to chemical handling, material properties, and lab safety.",
    "Civil Engineering": "Skills related to infrastructure design, construction, and structural analysis.",
    "Cloud Computing": "Skills related to cloud infrastructure, deployment, and service management.",
    "Communication Skills": "Skills related to effective verbal and written communication, and interpersonal interaction.",
    "Compliance and Ethics": "Skills related to regulatory compliance, ethical standards, and governance.",
    "Construction Safety": "Skills related to workplace safety, hazard identification, and safety protocols.",
    "Creative and Presentation Skills": "Skills related to creative expression, visual presentation, and storytelling.",
    "Cybersecurity": "Skills related to information security, threat detection, and risk mitigation.",
    "Data Analysis": "Skills related to data interpretation, statistical analysis, and business intelligence.",
    "Digital Marketing": "Skills related to online advertising, SEO, and social media strategy.",
    "Early Childhood Education": "Skills related to child development, pedagogy, and classroom management.",
    "Electrical Engineering": "Skills related to electrical systems, circuit design, and power distribution.",
    "Electronic Systems": "Skills related to electronic components, diagnostics, and embedded systems.",
    "Emergency Response": "Skills related to crisis management, first aid, and disaster preparedness.",
    "Environmental Management": "Skills related to sustainability, environmental compliance, and resource conservation.",
    "Equipment Maintenance": "Skills related to machinery upkeep, calibration, and troubleshooting.",
    "Event Management": "Skills related to planning, organizing, and executing events.",
    "Food Safety, Standards and Innovation": "Skills related to food hygiene, sanitation, regulatory compliance, and food innovation.",
    "Graphic Design": "Skills related to visual design, typography, and digital illustration.",
    "Health and Wellness": "Skills related to personal health, fitness, and wellness coaching.",
    "Healthcare Administration": "Skills related to medical office management, billing, and healthcare systems.",
    "Hospitality Management": "Skills related to guest services, hotel operations, and customer experience.",
    "Human Resources": "Skills related to recruitment, employee relations, and HR compliance.",
    "Industrial Automation": "Skills related to robotics, control systems, and automated manufacturing.",
    "Information Management": "Skills related to data governance, privacy, and information architecture.",
    "Information Technology": "Skills related to software development, system administration, and IT support.",
    "Leadership and Management": "Skills related to team leadership, strategic planning, and decision-making.",
    "Legal and Advisory": "Skills related to legal research, documentation, and advisory services.",
    "Logistics and Supply Chain": "Skills related to inventory management, transportation, and procurement.",
    "Machine Learning": "Skills related to supervised learning, model training, and algorithm development.",
    "Manufacturing and Production": "Skills related to production processes, quality control, and lean manufacturing.",
    "Maritime Operations": "Skills related to vessel operations, cargo handling, and navigation.",
    "Maritime Safety and Operations": "Skills related to emergency procedures, safety drills, and maritime regulations.",
    "Medical Devices": "Skills related to device operation, maintenance, and regulatory standards.",
    "Mental Health Awareness": "Skills related to psychological well-being, stress management, and support systems.",
    "Network Administration": "Skills related to network setup, monitoring, and troubleshooting.",
    "Nursing and Patient Care": "Skills related to clinical care, patient support, and medical procedures.",
    "Occupational Health and Safety": "Skills related to workplace health, risk assessment, and safety compliance.",
    "Operations and Logistics": "Skills related to operational planning, logistics coordination, and resource management.",
    "Organizational Skills": "Skills related to time management, task prioritization, and workflow optimization.",
    "Problem Solving and Analysis": "Skills related to analytical thinking, troubleshooting, and decision-making.",
    "Professional and Interpersonal Skills": "Skills related to collaboration, empathy, and workplace etiquette.",
    "Project Management": "Skills related to project planning, execution, and stakeholder communication.",
    "Public Health": "Skills related to epidemiology, health policy, and community health initiatives.",
    "Risk Assessment and Insurance": "Skills related to risk evaluation, insurance policies, claims management, and regulatory compliance.",
    "Technical Writing and Documentation": "Skills related to creating, editing, and managing technical documents, manuals, specifications, and user guides."
  }
}