{
  "domains": {
    "Accounting and Finance": "Skills related to financial management, regulatory compliance, risk assessment, and financial reporting.",
    "Legal Practice": "Skills related to legal analysis, document drafting, negotiation, and compliance.",
    "Banking Operations": "Skills related to banking operations, cross-departmental coordination, and regulatory compliance.",
    "Maritime and Port Operations": "Skills related to maritime operations, port logistics, vessel communication, and safety protocols.",
    "Administrative Management": "Skills related to document management, administrative processes, and compliance oversight.",
    "Procurement and Supply Chain": "Skills related to vendor management, supply chain risk assessment, and procurement strategies.",
    "Live Event Production": "Skills related to stage setup, lighting, rigging, audio systems, and event coordination.",
    "Community Development": "Skills related to community engagement, social program management, and cultural event coordination.",
    "Tourism and Hospitality": "Skills related to customer service, tourism promotion, and hospitality management.",
    "Vehicle and Fleet Management": "Skills related to vehicle maintenance, fleet coordination, and diagnostic analysis.",
    "Visual Arts": "Skills related to painting, sculpture, digital illustration, and creative project management.",
    "Cultural Heritage and Documentation": "Skills related to archival management, document preservation, and cultural information systems.",
    "Design Research and Innovation": "Skills related to user experience research, product development, and innovation management.",
    "Electronics and Electrical Systems": "Skills related to circuit design, electronics maintenance, and embedded systems development.",
    "Paper and Fiber Manufacturing": "Skills related to paper production, fiber quality control, and sustainable manufacturing practices.",
    "Food Industry": "Skills related to food production, quality assurance, and safety standards.",
    "Industrial Health, Safety, and Environment (HSE)": "Skills related to safety protocols, environmental compliance, and risk assessment.",
    "Insurance Operations": "Skills related to claims processing, risk management, and regulatory compliance."
  }
}