{
  "domains": {
    "Financial Management": "Skills related to financial planning, analysis, reporting, and compliance.",
    "Electrical Engineering": "Skills related to electrical systems, circuit design, and power systems.",
    "Electronics": "Skills related to electronic components, circuit design, and system diagnostics.",
    "Data Analysis": "Skills related to data analysis, interpretation, and business intelligence.",
    "Environmental Management": "Skills related to environmental compliance, resource management, and sustainability.",
    "Manufacturing and Production": "Skills related to manufacturing processes, quality control, and production line management.",
    "Food Safety and Standards": "Skills related to food safety, sanitation, and regulatory compliance.",
    "Procurement and Supply Chain": "Skills related to procurement, supply chain management, and logistics.",
    "Hotel and Hospitality": "Skills related to hotel operations, guest services, and hospitality management.",
    "Risk and Compliance": "Skills related to risk assessment, compliance management, and regulatory standards.",
    "Legal and Advisory": "Skills related to legal analysis, counseling, and document preparation.",
    "Maritime Operations": "Skills related to maritime cargo handling, vessel communication, and port operations.",
    "Equipment Maintenance": "Skills related to equipment maintenance, calibration, and repair.",
    "Negotiation and Contract Management": "Skills related to negotiation, contract management, and vendor partnerships.",
    "Event Management": "Skills related to event planning, management, and safety.",
    "Tourism and Hospitality": "Skills related to tourism, customer service, and regional knowledge.",
    "Visual Arts": "Skills related to visual arts, creative expression, and art history.",
    "Technical Documentation": "Skills related to technical documentation, writing, and information management.",
    "Automotive Maintenance": "Skills related to automotive troubleshooting, diagnostics, and repair.",
    "Information Management": "Skills related to data protection, privacy laws, and information architecture.",
    "Chemical and Material Science": "Skills related to chemical handling, management, material science, and fiber science.",
    "Process and Quality Management": "Skills related to process optimization, quality assurance, and quality management in various industries.",
    "Product Development and Innovation": "Skills related to the development and innovation of products, including food packaging and paper products.",
    "Maritime Safety and Operations": "Skills related to maritime safety, emergency response, engine room operations, and bridge watch management.",
    "Professional and Interpersonal Skills": "Skills related to professional interaction, communication, teamwork, and cross-cultural understanding.",
    "Sales and Marketing": "Skills related to sales, marketing, and brand management.",
    "Strategic and Operational Management": "Skills related to strategic planning, corporate strategy development, and operational efficiency.",
    "Safety and Compliance": "Skills related to safety procedures, workplace safety regulations, and crisis response.",
    "Technical and Mechanical Skills": "Skills related to metalworking, theatrical rigging, and projection systems.",
    "Creative and Presentation Skills": "Skills related to creative work presentation, project showcase development, and color matching.",
    "Information Technology": "Skills related to software performance testing, system optimization, content management systems, and website management.",
    "Administrative and Management Skills": "Skills related to administrative management, user permission management, interdepartmental communication, and juggling multiple tasks.",
    "Operations and Logistics": "Skills related to operations coordination, terminal management, and logistics management.",
    "Problem Solving and Analysis": "Skills related to problem resolution, diagnosis, critical thinking, and solution development.",
    "Regional and Local Knowledge": "Skills related to area knowledge, regional expertise, and local market understanding.",
    "Organizational Skills": "Skills related to organization, planning, and efficient management of resources and tasks.",
    "Business and Strategy": "Skills related to business strategy, market research, and negotiation.",
    "Organizational and Office Management": "Skills related to office organization, document management, and administrative support."
  }
}